In [1]:
import numpy  as np
import pandas as pd

## Cat

In [2]:
df = pd.DataFrame(); df['ABC']=['A1  @B1@C1','A2@ B2@C2','A3@B3@ C3', None]; df

          ABC
0  A1  @B1@C1
1   A2@ B2@C2
2   A3@B3@ C3
3        None

In [3]:
# input
A, B, C = [], [], []

for i in df['ABC']:
    
    if i == None: i='@@'
    splt = i.split('@')
    
    if len(splt[0].strip()) > 0 : A.append( str(splt[0].strip()) )
    else                        : A.append( None )
    
    if len(splt[1].strip()) > 0 : B.append( str(splt[1].strip()) )
    else                        : B.append( None )
    
    if len(splt[2].strip()) > 0 : C.append( str(splt[2].strip()) )
    else                        : C.append( None )
        
df[ 'A' ] = A
df[ 'B' ] = B
df[ 'C' ] = C 
df[ ['ABC','A','B','C'] ].head()

          ABC     A     B     C
0  A1  @B1@C1    A1    B1    C1
1   A2@ B2@C2    A2    B2    C2
2   A3@B3@ C3    A3    B3    C3
3        None  None  None  None

## Cat-Sc Group
 - grouping a Scalar by a Categorical
 - Making New Columns Based  on Count, Mean, Median, Min, Max

In [4]:
df = pd.DataFrame()
df['C'] = ['A', 'A', None, 'B', 'B', 'B'  ]
df['S'] = [ 10, 20,  100,  200, 300, None ]
df

      C      S
0     A   10.0
1     A   20.0
2  None  100.0
3     B  200.0
4     B  300.0
5     B    NaN

In [5]:
g = df.groupby('C').count()  # count mean median min max

df['G'] = np.nan*df.shape[0]
for sub in g.index: 
    df.loc[ df['C']==sub, 'G' ] = g.loc[sub,'S']
    
df

      C      S    G
0     A   10.0  2.0
1     A   20.0  2.0
2  None  100.0  NaN
3     B  200.0  2.0
4     B  300.0  2.0
5     B    NaN  2.0

## Sc Binning

In [6]:
df = pd.DataFrame()
df['S'] = [74, 77, 84, None, 89, 95]
df

      S
0  74.0
1  77.0
2  84.0
3   NaN
4  89.0
5  95.0

In [7]:
df['Bin'] = '-'*df.shape[0] 
for i in df.index:
    if   df.loc[i,'S'] >=  90 : df.loc[i,'Bin'] = '90-100'
    elif df.loc[i,'S'] >=  80 : df.loc[i,'Bin'] = '80-89'
    elif df.loc[i,'S'] >=  70 : df.loc[i,'Bin'] = '70-79'
    elif df.loc[i,'S'] <   70 : df.loc[i,'Bin'] = '0-69'
    else                      : df.loc[i,'Bin'] =  None
df

      S     Bin
0  74.0   70-79
1  77.0   70-79
2  84.0   80-89
3   NaN    None
4  89.0   80-89
5  95.0  90-100

## Sc Ratio & Operations
 - Note: Do it after Imputing by KNN

In [8]:
df = pd.DataFrame()
df['S1'] = [1,3,None, 5]
df['S2'] = [5,12,20,None]
df

    S1    S2
0  1.0   5.0
1  3.0  12.0
2  NaN  20.0
3  5.0   NaN

In [9]:
df[  'Ratio'   ] = df['S1'] / df['S2']
df['Operations'] = df['S1'] + df['S2']
df

    S1    S2  Ratio  Operations
0  1.0   5.0   0.20         6.0
1  3.0  12.0   0.25        15.0
2  NaN  20.0    NaN         NaN
3  5.0   NaN    NaN         NaN

## Date & Time

In [10]:
df = pd.DataFrame()
df['DATE-TIME'] = ['Sat Feb 10 14:52:31 2024','Sun Feb 11 16:27:59 2024',None]  # import time; time.ctime()
df

                  DATE-TIME
0  Sat Feb 10 14:52:31 2024
1  Sun Feb 11 16:27:59 2024
2                      None

In [11]:
df['DATE-TIME'] = pd.to_datetime( df['DATE-TIME'] )

df[ 'YEAR' ] = df['DATE-TIME'].dt.year
df['MONTH' ] = df['DATE-TIME'].dt.month
df[ 'DAY'  ] = df['DATE-TIME'].dt.day
df[ 'HOUR' ] = df['DATE-TIME'].dt.hour
df['MINUTE'] = df['DATE-TIME'].dt.minute
df['SECOND'] = df['DATE-TIME'].dt.second
df

            DATE-TIME    YEAR  MONTH   DAY  HOUR  MINUTE  SECOND
0 2024-02-10 14:52:31  2024.0    2.0  10.0  14.0    52.0    31.0
1 2024-02-11 16:27:59  2024.0    2.0  11.0  16.0    27.0    59.0
2                 NaT     NaN    NaN   NaN   NaN     NaN     NaN

#####

#####